Revit 2027 API
RebarSpliceRules.RunOutPosition Property
 Identifies the run-out position. The default value is RebarSpliceByRulesRunOutPosition.End.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarSpliceByRulesRunOutPosition RunOutPosition { get; set; }
Public Property RunOutPosition As RebarSpliceByRulesRunOutPosition
	Get
	Set
public:
property RebarSpliceByRulesRunOutPosition RunOutPosition {
	RebarSpliceByRulesRunOutPosition get ();
	void set (RebarSpliceByRulesRunOutPosition value);
}
member RunOutPosition : RebarSpliceByRulesRunOutPosition with get, set
Property Value
RebarSpliceByRulesRunOutPosition
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarSpliceRules Class
Autodesk.Revit.DB.Structure Namespace